Documents/упЗаправкаСливГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаправкаСливГСМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиГСМ</xr:Item>
				<xr:Item>AccumulationRegister.упОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДвиженияТоплива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПрочиеСоглашения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыЗаправки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТопливныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упОстаткиГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упОстаткиГСМ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияТоплива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДвиженияТоплива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТопливныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/упОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Comment>Сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
						<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаправкаСливГСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.упПоступлениеМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.упКорректировкаОстатковМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/упСпособыЗаправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыЗаправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкладГСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторонняяОрганизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыДвиженияТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыДвиженияТоплива</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упМетодыОценкиСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упМетодыОценкиСтоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упЗаправкаСливГСМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
	
	Если СпособЗаправки = Перечисления.упСпособыЗаправки.СкладГСМ Тогда
		ДополнительныеСвойства.Вставить("МетодОценки", упСервисныеФункции.ПолучитьЗначениеКонстанты("упМетодОценкиСтоимостиМатериалов"));
		Документы.упЗаправкаСливГСМ.ИнициализироватьДанныеДокумента(Дата, ВидДвижения, Ссылка, ДополнительныеСвойства);
	КонецЕсли;	
	
	ЕстьБолееПоздниеДокументы(Отказ);
	Если НЕ Отказ Тогда
		РеквизитыОбъекта = Новый Структура();
		РеквизитыОбъекта.Вставить("Дата", 					Дата);										
		РеквизитыОбъекта.Вставить("ТранспортноеСредство", 	ТранспортноеСредство);										
		РеквизитыОбъекта.Вставить("ВидДвижения", 			ВидДвижения);										
		РеквизитыОбъекта.Вставить("СпособЗаправки", 		СпособЗаправки);										
		РеквизитыОбъекта.Вставить("Склад", 					Склад);
		
		Если СпособЗаправки = Перечисления.упСпособыЗаправки.СкладГСМ 
				И ВидДвижения = Перечисления.упВидыДвиженияТоплива.Заправка Тогда
			РеквизитыОбъекта.Вставить("Граница", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
		КонецЕсли;
			
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упОстаткиГСМ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", 	ТранспортноеСредство);
		ЭлементБлокировки.УстановитьЗначение("ВидГСМ", 					ВидГСМ);
		
		Если СпособЗаправки = Перечисления.упСпособыЗаправки.СкладГСМ Тогда
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упОстаткиМатериалов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Материал", 	ГСМ);
			Если ВидДвижения = Перечисления.упВидыДвиженияТоплива.Слив Тогда
				ЭлементБлокировки.УстановитьЗначение("Партия", 	Ссылка);	
			КонецЕсли;
			ЭлементБлокировки.УстановитьЗначение("Склад", 		Склад);
		КонецЕсли;
		
		Попытка
			БлокировкаДанных.Заблокировать();
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
			ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка, ,Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
			Возврат;
		КонецПопытки;
		
		тбзОстаткиГСМ = упПутевойЛистУчетГСМ.СтруктураТаблицыОстаткиГСМ();
		
		СтрокаОстаткиГСМ = тбзОстаткиГСМ.Добавить();
		СтрокаОстаткиГСМ.Период					= Дата;
		СтрокаОстаткиГСМ.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаОстаткиГСМ.ВидГСМ 				= ВидГСМ;
		СтрокаОстаткиГСМ.ТопливнаяКарта			= ТопливнаяКарта;
		СтрокаОстаткиГСМ.Количество 			= Количество;
		Если ВедетсяВалютныйУчет Тогда
			СтрокаОстаткиГСМ.Стоимость 				= упСервисныеФункцииВызовСервера.РассчитатьСуммуУпр(Валюта, Стоимость, Дата);
			СтрокаОстаткиГСМ.СтоимостьНДС 			= упСервисныеФункцииВызовСервера.РассчитатьСуммуУпр(Валюта, СтоимостьНДС, Дата);	
		Иначе	
			СтрокаОстаткиГСМ.Стоимость 				= Стоимость;
			СтрокаОстаткиГСМ.СтоимостьНДС 			= СтоимостьНДС;	
		КонецЕсли;
		СтрокаОстаткиГСМ.ВидДвиженияТоплива 	= ВидДвижения;
		СтрокаОстаткиГСМ.ВидДвижения 			= ?(ВидДвижения = Перечисления.упВидыДвиженияТоплива.Заправка, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		
		// Если это слив в ТС или доп.оборудование 
		Если ВидДвижения = Перечисления.упВидыДвиженияТоплива.Слив
			И СпособЗаправки = Перечисления.упСпособыЗаправки.ТранспортноеСредство Тогда
			
			// Увеличиваются остатки по соответствующему ТС или доп.оборудованию
			СтрокаОстаткиГСМ = тбзОстаткиГСМ.Добавить();
			СтрокаОстаткиГСМ.Период					= Дата;
			СтрокаОстаткиГСМ.ТранспортноеСредство 	= Склад;
			СтрокаОстаткиГСМ.ВидГСМ 				= ВидГСМ;
			СтрокаОстаткиГСМ.ТопливнаяКарта			= ТопливнаяКарта;
			СтрокаОстаткиГСМ.Количество 			= Количество;
			Если ВедетсяВалютныйУчет Тогда
				СтрокаОстаткиГСМ.Стоимость 				= упСервисныеФункцииВызовСервера.РассчитатьСуммуУпр(Валюта, Стоимость, Дата);
				СтрокаОстаткиГСМ.СтоимостьНДС 			= упСервисныеФункцииВызовСервера.РассчитатьСуммуУпр(Валюта, СтоимостьНДС, Дата);	
			Иначе	
				СтрокаОстаткиГСМ.Стоимость 				= Стоимость;
				СтрокаОстаткиГСМ.СтоимостьНДС 			= СтоимостьНДС;	
			КонецЕсли;
			СтрокаОстаткиГСМ.ВидДвиженияТоплива 	= ВидДвижения;
			СтрокаОстаткиГСМ.ВидДвижения 			= ВидДвиженияНакопления.Приход;
			
		КонецЕсли;	
		
		ДополнительныеСвойства.Вставить("тбзОстаткиГСМ", 		тбзОстаткиГСМ);										
		
		упПутевойЛистУчетГСМ.СформироватьДвижениеОстаткиГСМ(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
		// Формирование движений по регистру накопления "упОстаткиМатериалов"
		Если СпособЗаправки = Перечисления.упСпособыЗаправки.СкладГСМ Тогда
			Если ВидДвижения = Перечисления.упВидыДвиженияТоплива.Заправка Тогда
				упУправлениеЗапасами.РассчитатьСуммыСписанияМатериалов(ДополнительныеСвойства, Ссылка, РеквизитыОбъекта, Отказ);	
			КонецЕсли;
			упУправлениеЗапасами.СформироватьДвиженияОстаткиМатериалов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		КонецЕсли;	
								
		Движения.Записать();
				
		упПутевойЛистУчетГСМ.ПроконтролироватьОтрицательныеОстатки(ВидГСМ, ТранспортноеСредство, Отказ);
		упПутевойЛистУчетГСМ.ПроконтролироватьПереливБака(ДополнительныеСвойства, Ссылка, РеквизитыОбъекта, Отказ);
				
		Если СпособЗаправки = Перечисления.упСпособыЗаправки.СкладГСМ 
				И ВидДвижения = Перечисления.упВидыДвиженияТоплива.Заправка 
				И Не ДополнительныеСвойства.МетодОценки = Перечисления.упМетодыОценкиСтоимости.ФИФО Тогда
			РеквизитыОбъекта.Вставить("Граница", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая));	
			РеквизитыОбъекта.Вставить("ГраницаИсключая", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
			// Контроль возникновения отрицательных остатков по складу
	        упУправлениеЗапасами.КонтрольОстатковМатериалов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ЕстьБолееПоздниеДокументы(Отказ)
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упОстаткиГСМ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", 	ТранспортноеСредство);
	ЭлементБлокировки.УстановитьЗначение("ВидГСМ", 					ВидГСМ);
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Отказ = НЕ упПутевойЛистУчетГСМ.ЭтоПоследнийДокументИзменявшийОстаткиГСМ(Ссылка, Дата, ТранспортноеСредство, ВидГСМ);
	
	Если Отказ Тогда
		ТекстСообщения = Нстр("ru = 'Существуют более поздние документы изменяющие остатки ГСМ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЕстьБолееПоздниеДокументы(Отказ);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособЗаправки = Перечисления.упСпособыЗаправки.СкладГСМ Тогда
		ПроверяемыеРеквизиты.Добавить("Склад");
		ПроверяемыеРеквизиты.Добавить("ГСМ");
	ИначеЕсли СпособЗаправки = Перечисления.упСпособыЗаправки.ТранспортноеСредство Тогда
		ПроверяемыеРеквизиты.Добавить("ТранспортноеСредство");
	ИначеЕсли СпособЗаправки = Перечисления.упСпособыЗаправки.СторонняяОрганизация Тогда	
		ПроверяемыеРеквизиты.Добавить("Контрагент");	
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
